Инструменты/src/DataProcessors/УИ_КонсольЗапросов/УИ_КонсольЗапросов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УИ_КонсольЗапросов</name>
  <comment>Synoecium, ver 1.2.3</comment>
  <attributes>
    <name>ИспользоватьАвтосохранение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалАвтосохранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьТолькоВыделеннуюОбласть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБэкапЗапросов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДеревоЗапросов</name>
    <type>
      <types>ValueTree</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксНастроек</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПути</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСжатиеФайлов_УФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиКонсоли</name>
  </attributes>
  <attributes>
    <name>РежимПодсветки_УФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Инструменты/src/DataProcessors/УИ_КонсольЗапросов/ObjectModule.bsl
//TODO
//1. Совместимость с типовой консолью запросов
//2. Выполнение кода для ТЗ и других полей с расшифровкой в результате запросов
//3. Загрузка ТЗ в параметрах из Excel
//4. Копипаст в формах не примитивных типов


Процедура моВосстановитьНастройки() Экспорт
	ПрефиксНастроек = Метаданные().Имя+"_";
	ИспользоватьАвтосохранение 				= ХранилищеНастроекДанныхФорм.Загрузить(ПрефиксНастроек,"ИспользоватьАвтосохранение");
	ИнтервалАвтосохранения     				= ХранилищеНастроекДанныхФорм.Загрузить(ПрефиксНастроек,"ИнтервалАвтосохранения");
	ИспользоватьБэкапЗапросов  				= ХранилищеНастроекДанныхФорм.Загрузить(ПрефиксНастроек,"ИспользоватьБэкапЗапросов");
	ИспользоватьТолькоВыделеннуюОбласть  	= ХранилищеНастроекДанныхФорм.Загрузить(ПрефиксНастроек,"ИспользоватьТолькоВыделеннуюОбласть");
	ИспользоватьСжатиеФайлов_УФ  			= ХранилищеНастроекДанныхФорм.Загрузить(ПрефиксНастроек,"ИспользоватьСжатиеФайлов_УФ");
	РежимПодсветки_УФ  						= ХранилищеНастроекДанныхФорм.Загрузить(ПрефиксНастроек,"РежимПодсветки_УФ");
КонецПроцедуры

Процедура моСохранитьНастройки() Экспорт
	ХранилищеНастроекДанныхФорм.Сохранить(ПрефиксНастроек,"ИспользоватьАвтосохранение",ИспользоватьАвтосохранение);
	ХранилищеНастроекДанныхФорм.Сохранить(ПрефиксНастроек,"ИнтервалАвтосохранения",ИнтервалАвтосохранения);
	ХранилищеНастроекДанныхФорм.Сохранить(ПрефиксНастроек,"ИспользоватьБэкапЗапросов",ИспользоватьБэкапЗапросов);
	ХранилищеНастроекДанныхФорм.Сохранить(ПрефиксНастроек,"ИспользоватьТолькоВыделеннуюОбласть",ИспользоватьТолькоВыделеннуюОбласть);
	ХранилищеНастроекДанныхФорм.Сохранить(ПрефиксНастроек,"ИспользоватьСжатиеФайлов_УФ",ИспользоватьСжатиеФайлов_УФ);
	ХранилищеНастроекДанныхФорм.Сохранить(ПрефиксНастроек,"РежимПодсветки_УФ",РежимПодсветки_УФ);
КонецПроцедуры

Процедура моВосстановитьИмяФайла() Экспорт
	ИмяФайла    = ХранилищеНастроекДанныхФорм.Загрузить(ПрефиксНастроек,"ИмяФайла");
	ИмяПути     = ХранилищеНастроекДанныхФорм.Загрузить(ПрефиксНастроек,"ИмяПути");
КонецПроцедуры

Процедура моСохранитьИмяФайла() Экспорт
	ХранилищеНастроекДанныхФорм.Сохранить(ПрефиксНастроек,"ИмяФайла",ИмяФайла);
	ХранилищеНастроекДанныхФорм.Сохранить(ПрефиксНастроек,"ИмяПути",ИмяПути);
КонецПроцедуры
